package ShanDong.version2;


import java.util.HashSet;
import java.util.Iterator;
import java.util.Set;

/**
 * Created by ${LiuShuo} on 8/10/2016.
 */
public class Testadd {
    public static void main(String[] args) throws Exception {
//        Object o = AddressFilterAlgorithm.getModelAddress("山东省日照市东港区康定路40号", "name");
        Object o = NameENameCompositeFilterAlgorithm.getModelComName("\"山东省日照市实验中学\"", 123);
//        Object o = ICCompositeFilterAlgorithm.getModelIDCard("220323920308081",null);
        System.out.println(o);


        /*String[] noChange1 = {"古", "江", "街", "款", "初", "班", "饭", "期", "分", "大", "附", "北", "站", "左", "屯", "坊", "巷", "城", "省", "厂", "四", "乡", "九", "院", "路", "县", "区", "园", "室", "镇", "面", "桥", "堍", "层", "内", "幢", "洲", "州", "厦", "家", "楼", "南", "侧", "店", "前", "部", "弄", "旁", "组", "庄", "浜", "十", "户", "中", "社", "荡", "八", "市", "队", "六", "栋", "后", "五", "东", "号", "村", "右", "第", "苑", "三", "西", "小", "座", "环", "寺", "一", "七", "二", "口", "委", "道", "F", "~", "！", "@", "#", "￥", "%", "…", "^", "……", "&", "*", "（", "）", "—", "—", "+", "}", "{", "：", "“", "》", "《", "？", "-", "(", ")", ".", "、", ","
                ,"厅","副","会","所","院","站","台","部","局","9","8","7","6","5","4","3","2","1","0","大", "附", "北", "站", "左", "屯", "坊", "巷", "城", "省", "厂", "四", "乡", "九", "院", "路", "县", "区", "园", "室", "镇", "面", "桥", "堍", "层", "内", "幢", "洲", "州", "厦", "家", "楼", "南", "侧", "店", "前", "部", "弄", "旁", "组", "庄", "浜", "十", "户", "中", "社", "荡", "八", "市", "队", "六", "栋", "后", "五", "东", "号", "村", "右", "第", "苑", "三", "西", "小", "座", "环", "寺", "一", "七", "二", "口", "委", "道", "F", "~", "！", "@", "#", "￥", "%", "…", "^", "……", "&", "*", "（", "）", "—", "—", "+", "}", "{", "：", "“", "》", "《", "？", "-", "(", ")"

        };
        String[] noChange2 = {"河北", "衡水", "中学", "小学", "学校", "高中", "大学", "增补", "个人", "代发", "电声", "浙江", "针织", "童装", "旅游", "塑料", "回收", "宾馆", "装饰", "工资", "技校", "勘察", "地质", "保险", "物业", "安装", "实验", "纺织", "景观", "超市", "宾馆", "商城", "电视", "建设", "宁夏", "核算", "汽车", "流通", "木业", "餐饮", "家私", "农民", "酒店", "水果", "化工", "支行", "银川", "维修", "交通", "发展", "银行", "器材", "市场", "实业", "机械", "工贸", "二手", "批发", "食堂", "车行", "集中", "机电", "宿舍", "小额", "大街", "电器", "制造", "固原", "工程", "专业", "幼儿", "农场", "集团", "综合", "社区", "科技", "瓜果", "清真", "码头", "园区", "休闲", "粮油", "商行", "管理", "股份", "商业", "文化", "传播", "中卫", "广播", "酒楼", "单元", "中心", "印刷", "开发", "防水", "吴忠", "电子", "资金", "大修", "责任", "建材", "幕墙", "印务", "医疗", "嘉兴", "农村", "有限", "物资", "器械", "珠宝", "电力", "资产", "贷款", "苗木", "办公", "服装", "服务", "花园", "村级", "种植", "公司", "行政", "咨询", "养殖", "保洁", "小区", "设备", "天窗", "街道", "园林", "公路", "节能", "销售", "贸易", "商贸", "连锁", "胶粘", "制品", "路桥", "矿业", "南寺", "工业", "陶瓷", "农业", "果蔬"
                ,"组织","监察","支队","城管","工委","宣传","车队","促进","党校","财政","交易","精神","畜牧","动物","监督","财政","海洋","国际","分行","环保","监测","检测","示范","林业","国资","地籍","编制","机构","运动","保卫","孵化","运营","财务","营业","房间","挖潜","生育","控制","预防","疾病","供水","执法","国土","保护","环境","广电","网络","外事","联合","人民","第一","卫生","计划","分局","经济","政府","政协","中共","中学", "小学", "学校", "高中", "大学", "增补", "个人", "代发", "电声", "浙江", "针织", "童装", "旅游", "塑料", "回收", "宾馆", "装饰", "工资", "技校", "勘察", "地质", "保险", "物业", "安装", "实验", "纺织", "景观", "超市", "宾馆", "商城", "电视", "建设", "宁夏", "核算", "汽车", "流通", "木业", "餐饮", "家私", "农民", "酒店", "水果", "化工", "支行", "银川", "维修", "交通", "发展", "银行", "器材", "市场", "实业", "机械", "工贸", "二手", "批发", "食堂", "车行", "集中", "机电", "宿舍", "小额", "大街", "电器", "制造", "固原", "工程", "专业", "幼儿", "农场", "集团", "综合", "社区", "科技", "瓜果", "清真", "码头", "园区", "休闲", "粮油", "商行", "管理", "股份", "商业", "文化", "传播", "中卫", "广播", "酒楼", "单元", "中心", "印刷", "开发", "防水", "吴忠", "电子", "资金", "大修", "责任", "建材", "幕墙", "印务", "医疗", "嘉兴", "农村", "有限", "物资", "器械", "珠宝", "电力", "资产", "贷款", "苗木", "办公", "服装", "服务", "花园", "村级", "种植", "公司", "行政", "咨询", "养殖", "保洁", "小区", "设备", "天窗", "街道", "园林", "公路", "节能", "销售", "贸易", "商贸", "连锁", "胶粘", "制品", "路桥", "矿业", "南寺", "工业", "陶瓷", "农业", "果蔬"

        };
        String[] noChange3 = {"皮防病","公证处","信息化","皮肤病","分公司","总务处","纪检处","检察院","结核病","防治所","委员会","资源局","统计局","信访局","审计局","经营部", "农资店", "青铜峡", "自治县", "内蒙古", "石嘴山", "加盟店", "蒙古族", "土特产", "副食品", "合作社", "清真寺", "互助社", "竹纤维", "批发部", "经销部", "电动车"};

        String[] noChange4 = {"古", "江", "街", "款", "初", "班", "饭", "期", "分", "大", "附", "北", "站", "左", "屯", "坊", "巷", "城", "省", "厂", "四", "乡", "九", "院", "路", "县", "区", "园", "室", "镇", "面", "桥", "堍", "层", "内", "幢", "洲", "州", "厦", "家", "楼", "南", "侧", "店", "前", "部", "弄", "旁", "组", "庄", "浜", "十", "户", "中", "社", "荡", "八", "市", "队", "六", "栋", "后", "五", "东", "号", "村", "右", "第", "苑", "三", "西", "小", "座", "环", "寺", "一", "七", "二", "口", "委", "道", "F", "~", "！", "@", "#", "￥", "%", "…", "^", "……", "&", "*", "（", "）", "—", "—", "+", "}", "{", "：", "“", "》", "《", "？", "-", "(", ")", ".", "、", ","

        };
        String[] noChange5 = {"河北", "衡水", "中学", "小学", "学校", "高中", "大学", "增补", "个人", "代发", "电声", "浙江", "针织", "童装", "旅游", "塑料", "回收", "宾馆", "装饰", "工资", "技校", "勘察", "地质", "保险", "物业", "安装", "实验", "纺织", "景观", "超市", "宾馆", "商城", "电视", "建设", "宁夏", "核算", "汽车", "流通", "木业", "餐饮", "家私", "农民", "酒店", "水果", "化工", "支行", "银川", "维修", "交通", "发展", "银行", "器材", "市场", "实业", "机械", "工贸", "二手", "批发", "食堂", "车行", "集中", "机电", "宿舍", "小额", "大街", "电器", "制造", "固原", "工程", "专业", "幼儿", "农场", "集团", "综合", "社区", "科技", "瓜果", "清真", "码头", "园区", "休闲", "粮油", "商行", "管理", "股份", "商业", "文化", "传播", "中卫", "广播", "酒楼", "单元", "中心", "印刷", "开发", "防水", "吴忠", "电子", "资金", "大修", "责任", "建材", "幕墙", "印务", "医疗", "嘉兴", "农村", "有限", "物资", "器械", "珠宝", "电力", "资产", "贷款", "苗木", "办公", "服装", "服务", "花园", "村级", "种植", "公司", "行政", "咨询", "养殖", "保洁", "小区", "设备", "天窗", "街道", "园林", "公路", "节能", "销售", "贸易", "商贸", "连锁", "胶粘", "制品", "路桥", "矿业", "南寺", "工业", "陶瓷", "农业", "果蔬"

        };*/
/**
 "！","大","附","）","（","屯","城","厂","：","四","厅","？","乡","九","院","#","路","&","县","%","*","+","(",")","园",".",",","-","3","镇","2","1","0","面","班","7","6","桥","5","4","堍","局","9","8","内","层","洲","幢","厦","楼","F","江","@","弄","旁","浜","中","—","社","荡","市","队","^","款","栋","“","、","东","…","》","《","号","台","右","第","会","三","小","环","古","一","~","}","七","{","口","道","北","站","左","分","坊","巷","省","初","所","期","区","室","州","家","饭","南","……","店","侧","前","街","部","组","庄","十","户","八","六","后","五","副","￥","村","苑","西","座","寺","二","委"

 "童装","商城","党校","代发","交易","建设","房间","网络","汽车","木业","家私","酒店","水果","勘察","工资","保险","银川","维修","交通","国资","工贸","实业","二手","分行","批发","安装","保护","食堂","生育","旅游","宿舍","小额","电器","组织","计划","工程","监督","实验","农场","孵化","卫生","综合","科技","执法","运营","清真","码头","财政","粮油","管理","分局","商业","文化","广播","单元","印刷","开发","示范","吴忠","塑料","装饰","大修","个人","小学","建材","医疗","联合","技校","嘉兴","人民","学校","车队","资产","贷款","政府","服务","种植","中学","行政","工委","城管","地质","支队","监测","小区","设备","天窗","街道","公路","物业","胶粘","南寺","财务","精神","果蔬","机构","景观","地籍","超市","浙江","宾馆","电声","电视","宁夏","核算","流通","海洋","餐饮","农民","编制","化工","支行","促进","国土","发展","河北","器材","银行","市场","机械","疾病","车行","集中","外事","政协","机电","环境","大街","监察","固原","制造","针织","专业","控制","幼儿","集团","社区","第一","瓜果","环保","纺织","运动","园区","休闲","商行","中共","股份","传播","中卫","酒楼","中心","国际","防水","增补","广电","林业","高中","电子","资金","责任","幕墙","印务","大学","农村","有限","物资","器械","检测","珠宝","电力","苗木","办公","供水","保卫","服装","畜牧","经济","花园","村级","公司","咨询","回收","动物","衡水","养殖","保洁","宣传","园林","节能","销售","贸易","商贸","连锁","制品","挖潜","路桥","矿业","预防","工业","陶瓷","营业","农业"

 "分公司","经营部","农资店","结核病","自治县","内蒙古","信访局","石嘴山","土特产","互助社","委员会","竹纤维","资源局","审计局","总务处","纪检处","皮肤病","信息化","青铜峡","加盟店","蒙古族","清真寺","合作社","副食品","公证处","皮防病","批发部","防治所","经销部","统计局","电动车","检察院"

 *
 *
 *
 *
 */
        /*Set se = new HashSet();
        for (String str: noChange3) {
            se.add(str);
        }
        Iterator it = se.iterator();
        while (it.hasNext()){
            System.out.print("\""+it.next()+"\",");
        }*/





    }
}
