package huanghe.address;

import sun.awt.SunHints;

import java.util.HashSet;
import java.util.Iterator;
import java.util.Set;
import java.util.TreeSet;
import java.util.regex.Pattern;

/**
 * Created by ${LiuShuo} on 2016/6/22.
 */
public class TestADDR {
    public static void main(String[] args) {
//1号楼2单元301
//        Pattern p = Pattern.compile("^([\\u4e00-\\u9fa5])*([A-Za-z0-9_])*+(省|市|县|区|街|镇|楼|村)+([\\u4e00-\\u9fa5])*([A-Za-z0-9_])*$");
//        Pattern p = Pattern.compile("^([^\\x00-\\xff]|[A-Za-z0-9_])+$");
//        Pattern p = Pattern.compile("^([\\u4e00-\\u9fa5]|[A-Za-z0-9_])*+(省|市|县|区|街|镇|楼|村)+([\\u4e00-\\u9fa5]|[A-Za-z0-9_])*$");
//        Pattern p = Pattern.compile("^([\\u4e00-\\u9fa5])*([A-Za-z0-9_-])*(省|市|县|区|街|镇|楼|村)+([\\u4e00-\\u9fa5])*([A-Za-z0-9_-])*$");
//        boolean matches = p.matcher().matches();
//
//        System.out.println(matches);


//        Object m = Address2.getM("辽宁省葫芦岛市其他连山市昆山路莲花", 1);
//        System.out.println(m);



//        String[] noChange2 = {"银川","中卫","固原","吴忠","石嘴山","蒙古族","自治县","二手","车行","物资","经营部","宁夏","农村","商业","银行","股份","有限","公司","支行","吴忠","苗木","种植","专业","合作社","吴忠","养殖","专业","合作社","村级","发展","资金","互助社","吴忠","果蔬","种植","专业","合作社","交通","资产","管理","银川","家私","制造","保洁","服务","中心","商业","餐饮","中卫","小额","贷款","青铜峡","中心","副食品","批发部","宁夏","农村","商业","银行","股份","有限","公司","支行","吴忠","陶瓷","经销部","清真","南寺","清真","清真寺","内蒙古","实业","集团","中卫","农民","专业","合作社","宁夏","园林","景观","工程"};
//        Set s = new TreeSet();
//        for (int i = 0; i < noChange2.length; i++) {
//            s.add(noChange2[i]);
//        }
//        Iterator i = s.iterator();
//        while (i.hasNext()){
//            System.out.print("\""+i.next()+"\",");
//        }


//        byte[] b = {};
//        String s = "";
//        Object[] o = {b,s};
////        if (value instanceof byte[] )return value;
//        if (o[0] instanceof byte[] ){
//            System.out.println(123);
//        }
//
//        if (o[0] instanceof String ){
//            System.out.println(456);
//        }

//        String str = "区小校";
//        String[] arrStr1 = str.split("区");
//        if (arrStr1.length < 2) System.out.println(123);
//        System.out.println(arrStr1[1]);
//       System.out.println("小区,单元,大街,酒店,公司,花园,社区,宿舍,幼儿,园区,水果,市场,酒楼,服装,贸易,商城,电器,维修,行政,中心,开发,工贸,批发,工业,机械,综合,休闲,码头,食堂".replace(",","\",\""));
//        Object m = Address3.getM("嘉兴市天天嘉苑4幢1号办公房2层西区", 1);
//        System.out.println(m);

       /* String[] s = {
                "缈","游","温","逸","嵋","瞻","颜","缺","渊","暖","清","觅","观","崧","遥","喻","更","喧","曲","崴","曼","罕","曹","崎","腾","湛","石","崇","喜","飞","飘","善","知",
                "崖","风","矩","道","啸","巡","邦","昭","真","巧","映","巨","春","美","邵","省","昱","羚","溪","昴","羞","昶","眺","昊","源","明","昏","昌","群","昂","昆","昙","星",
                "易","羿","商","州","川","羽","昕","昔","景","晨","顺","翁","晤","顶","翎","页","唱","翔","唯","满","智","唤","晴","都","致","晋","至","晃","唐","晟","西","臣","晖",
                "翼","晓","自","皆","而","皇","袖","耀","馨","山","考","皎","袁","皓","耘","哲","枯","品","林","哈","屑","哉","枚","果","展","枝","极","屋","届","耿","首","耽","屏",
                "枇","香","枋","居","耶","尼","潭","柳","柱","益","盈","咨","查","咱","聚","尧","柯","盛","柔","尘","聪","柒","尚","和","目","尖","酒","少","柚","柄","直","咖","酋",
                "尊","盼","柏","将","封","相","肃","峰","周","朽","峻","朱","朴","未","末","峡","术","肖","本","峪","峨","峭","纱","呈","纳","望","纷","纹","纸","肩","纺","纽","朔",
                "员","月","有","红","朋","服","肴","约","级","纪","纯","启","板","松","结","岳","含","统","绘","岸","杰","细","行","织","组","绅","杭","胜","吴","来","绍","绊","终",
                "条","岩","名","维","同","杜","胥","岗","束","后","杞","吉","合","金","衷","各","绿","釜","材","岛","岚","白","采","百","李","杏","癸","衫","杉","表","君","野","量",
                "吕","里","重","释","绩","向","衣","累","乾","埔","计","紫","氛","订","训","疾","讯","气","索","民","素","书","城","设","访","许","习","论","彭","九","埴","彬","彩",
                "乘","永","彪","彤","乔","彦","乖","培","乐","乓","基","乒","义","茉","久","茄","茅","疏","彷","彰","茂","范","影","茁","主","为","弈","江","高","串","丰","语","荷",
                "临","垂","弘","型","汀","荣","丙","丘","证","诀","业","汽","识","东","评","丞","汾","汴","词","弧","世","弦","强","垣","诗","诚","池","七","万","忆","价","必","坚",
                "仲","町","仰","沐","甲","任","申","沛","田","沙","志","沅","沃","坊","沂","沁","均","莫","沈","甜","仕","生","忠","甘","仑","甚","仓","河","沼","沽","沾","沿","沸",
                "油","念","沧","仁","坪","忽","坤","从","坦","坡","沫","亳","泓","菲","征","泗","径","法","泛","律","徒","徐","产","得","亦","圃","享","泊","徙","亩","泉","徘","亨",
                "亮","圆","略","亭","徜","京","泰","御","留","云","场","泳","徨","地","驰","亚","圳","泽","波","泥","圭","界","德","马","争","注","圣","事","畅","于","般","斗","航",
                "佩","洋","料","文","使","船","洛","舷","舶","洗","回","佳","住","舍","幼","幽","位","洪","新","因","幸","并","年","津","施","璋","平","方","斧","派","洽","舟","佛",
                "余","图","洵","何","国","誉","洲","固","斩","佑","舒","佐","帛","帝","良","济","瓦","伯","传","流","米","浅","伦","伧","浙","师","浚","伺","旅","希","艾","旋","布",
                "市","帅","伴","族","帆","浪","伊","常","浩","时","旷","伏","伍","旺","浣","企","浦","既","伟","旦","席","日","早","旨","海","众","旭","涅","信","琪","芯","芮","芭",
                "俯","芬","修","琦","芫","琢","芷","芳","俱","涓","花","芽","攀","廉","芸","涛","芹","粗","政","润","延","放","粒","琉","节","芍","俏","理","收","俊","建","芊","俗",
                "芒","俐","俞","芝","保","言","芙","粉","嘉","若","庚","府","侯","敖","效","英","瑾","庆","敏","淘","床","苹","故","便","淡","康","庶","庸","庾","侍","苑","苓","深",
                "苔","度","瑞","座","苗","庭","依","央","冶","天","鑫","冰","太","冲","冬","珍","珏","珈","珊","珀","冠","拳","备","路","军","拉","夏","复","冒","拂","多","拓","珠",
                "越","笃","奢","出","奥","函","凰","超","玖","笑","玉","凯","笙","抱","凡","笛","玄","好","率","玻","奂","笠","奇","奋","玫","凌","奔","奕","净","准","资","执","铭",
                "扬","鱼","银","承","赤","扇","才","如","铁","妙","共","姬","兵","其","具","典","钦","兼","姿","全","六","贝","贡","财","贤","成","贵","兆","钟","克","光","先","钗",
                "武","步","正","长","堡","傲","歌","镜","穹","空","镇","堆","堂","欢","欣","次","欧","犁","锦","程","锐","萧","锋","竟","捷","毫","站","闻","倩","闲","蓝","问","豆",
                "门","立","闪","值","竿","牧","竹","牡","竺","倍","毅","物","章","豪","豫","倚","境","健","壮","振","壤","偃","殊","谷","挚","谦","桓","厚","桑","迪","桐","际","原",
                "祥","桔","蝶","桂","桃","祺","迁","迅","进","祖","桦","远","运","神","祟","栗","悉","树","阔","标","悟","字","达","社","孟","孝","参","辰","栋","熙","阡","辉","季",
                "栽","格","叶","悠","台","召","叮","可","孰","校","阳","熊","麦","古","栩","宋","守","秩","安","积","宏","北","雀","雁","轩","匙","宁","秦","宇","棕","棋","宛","恒",
                "定","宙","照","实","宝","宜","轻","宗","鹏","雪","秉","雨","宫","秋","秀","恩","客","宣","煜","鹿","恭","息","容","恰","鹤","科","棠","家","南","卓","隆","寂","博",
                "梓","升","禾","千","十","禹","华","梅","思","寒","梁","卉","福","卷","印","怡","梵","卿","鸽","卸","梳","梭","梯","融","卦","鸣","梨","寺","梧","卫","烨","青","靖",
                "威","娄","功","虹","努","烈","娱","懿","硕","加","务","虎","虔","硅","革","劲","励","炬","霖","炯","勉","炫","勋","霜","勇","霄","龙","炎","婷","研","勤","齐","列",
                "慈","则","刚","创","初","慎","灿","蛋","别","利","音","韵","韶","磊","韬","制","韦","前","鼎","意","瀚","修","宵","晨","戏","施","顺","祥","才","聪","银","戈","喻","声","生","铁","如","宸","誓","胜","挚","靖","齐",
                "锦","少","舟","任","载","翱","青","迁","钧","钟","金","慈","昌","紫","砂","仁","祖","韶","绍","锐","峻","裕","镇","壮","商",
                "翼","织","释","诚","常","净","秀","节","刊","信","崇","春","铭","秋","刚","诗","神","星","鉴","石","识","肃","瑞","新","鑫",
                "盛","帅","馨","惜","散","慎","世","书","千","善","镜","然","资","笑","疏","西","捷","超","川","锋","实","聚","尊","承","钦",
                "仕","众","思","茂","贤","棕","树","蓝","卷","谷","君","古","原","廉","建","庆","桦","统","若","攀","栋","荒","何","久","侠",
                "奇","朴","鸽","东","嘉","冠","松","啸","祺","琪","雁","宜","琦","枝","坚","昂","毅","歌","标","固","吉","高","康","尧","果",
                "杭","语","曲","肖","荷","芹","乾","义","杰","皓","凯","狂","本","勤","彬","景","月","兼","顷","柏","擎","荣","观","笃","恭",
                "柯","言","菲","萧","乔","群","谦","国","极","轻","玉","业","材","相","苑","倚","岳","柳","贵","悟","健","彦","棋","楷","桐",
                "气","颜","苛","池","闻","流","霜","福","泉","宏","弘","浅","熙","济","涛","震","和","闲","霖","向","波","渊","博","游","雨",
                "润","湛","凡","奔","夫","潮","深","岸","辉","浚","复","封","飞","朋","江","奉","晖","绘","浪","鸣","百","鹤","沙","漾","泥",
                "雪","孝","万","望","瀚","缈","淡","阜","保","阔","洪","恒","云","伯","玄","风","淘","合","文","莫","享","满","溪","妙","邦",
                "华","冰","方","寒","鹏","陌","奋","秉","泽","豪","布","明","民","虎","帆","洋","名","拂","海","潭","清","勉","源","平","物",
                "沧","霄","熊","论","彤","烟","阳","耀","励","晋","临","伦","日","传","炎","彰","全","丰","晓","瞻","拓","展","绩","炫","尘",
                "征","昙","道","飘","鼎","龙","昊","腾","至","宝","驰","易","耿","昆","振","知","光","灿","智","畅","晴","迪","绿","扬","来",
                "志","煊","遥","宁","衷","太","凌","天","璋","瑾","俊","里","韬","量","致","烨","忠","厉","理","路","年","循","昭","达","都",
                "蝶","章","照","积","良","泰","烈","庭","折","进","晟","德","际","琢","利","哲","质","隆","田","煜","南","乐","翎","冬","图",
                "暖","壤","佑","翔","伟","磊","欧","运","豫","维","坤","恩","永","意","野","幽","远","圣","山","城","音","韵","依","余","圆",
                "勋","忆","叶","亦","卫","傲","融","勇","逸","育","唯","基","容","温","安","奥","引","影","羽","均","誉","越","辰","轩","延",
                "境","宇","悠","益","岩","玮","威","硕","庸","懿","统","柏","彤","兼","昊","肖","杰","含","凯","振","秉","沧","享","朋","轻",
                "俊","材","宇","松","依","池","钦","桦","芹","孝","炫","极","洋","舟","际","荒","衷","亦","狂","闻","幽","曲","耿","勇","奇",
                "城","冰","柯","浦","林","和","明","名","建","尧","胜","朴","存","顺","昌","西","昙","砂","语","泰","伦","烈","杭","育","折",
                "达","顷","忠","延","坤","佑","修","闲","坚","泉","劲","勋","枝","年","迁","致","治","健","羽","晓","卷","如","宸","荷","物",
                "合","复","晖","易","灿","浅","悟","壮","临","荣","桦","乔","承","明","顺","物","原","统","哲","庭","运","修","远","峰","兼",
                "杉","莫","均","幽","高","闲","宝","拓","若","材","玮","余","苛","欢","凌","函","享","陌","亦","旷","全","君","思","秀","威",
                "海","烨","尧","声","展","秋","标","羽","昭","合","建","坤","南","利","华","伦","挚","宵","壮","众","晋","松","恩","阳","泉",
                "恭","树","钟","致","苑","封","诗","晓","戏","荣","里","拂","至","奋","初","图","烈","金","如","钦","俊","贵","宸","狂","益",
                "耿","积","复","勋","佑","肃","光","轻","施","任"
        };*/


        String[] s = {"款","初","班","饭","期","分","大","附","北","站","左","屯","坊","巷","城","省","厂","四","乡","九","院","路","县","区","园","室","镇","面","桥","堍","层","内","幢","洲","州","厦","家","楼","南","侧","店","前","部","弄","旁","组","庄","浜","十","户","中","社","荡","八","市","队","六","栋","后","五","东","号","村","右","第","苑","三","西","小","座","环","寺","一","七","二","口","委","道", "F","~","！","@","#","￥","%","…","^","……","&","*","（","）","—","—","+","}","{","：","“","》","《","？","-","(",")"

        };
//        String[] s = {"中学","小学","学校","高中","大学","增补","个人","代发","电声","浙江","针织","童装","旅游","塑料","回收","宾馆","装饰","工资","技校","勘察","地质","保险","物业","安装","实验","纺织","景观","超市","宾馆","商城","电视","建设","宁夏","核算","汽车","流通","木业","餐饮","家私","农民","酒店","水果","化工","支行","银川","维修","交通","发展","银行","器材","市场","实业","机械","工贸","二手","批发","食堂","车行","集中","机电","宿舍","小额","大街","电器","制造","固原","工程","专业","幼儿","农场","集团","综合","社区","科技","瓜果","清真","码头","园区","休闲","粮油","商行","管理","股份","商业","文化","传播","中卫","广播","酒楼","单元","中心","印刷","开发","防水","吴忠","电子","资金","大修","责任","建材","幕墙","印务","医疗","嘉兴","农村","有限","物资","器械","珠宝","电力","资产","贷款","苗木","办公","服装","服务","花园","村级","种植","公司","行政","咨询","养殖","保洁","小区","设备","天窗","街道","园林","公路","节能","销售","贸易","商贸","连锁","胶粘","制品","路桥","矿业","南寺","工业","陶瓷","农业","果蔬",
//
//        };
//        String[] s = {"经营部","农资店","青铜峡","自治县","内蒙古","石嘴山","加盟店","蒙古族","土特产","副食品","合作社","清真寺","互助社","竹纤维","批发部","经销部","电动车"};
//
/*
浙江
学


 */

        Set se = new HashSet();
        for (String str: s) {
            se.add(str);
        }
        Iterator it = se.iterator();
        while (it.hasNext()){
            System.out.print("\""+it.next()+"\",");
        }

//        Object m = Address3.getM("中山东路县南街46号三楼",145);
//        System.out.println(m);












    }
}
