package two_param.address;


import com.sun.corba.se.spi.ior.TaggedProfileTemplate;

//import java.util.HashMap;
import java.util.LinkedHashMap;

/**
 * Created by ${LiuShuo} on 2016/6/22.
 */
public class Address2 {
    public static Object getM(Object value, Object key){
        //判断参数是否为null、"null"、"" ,为true时不做处理
        if (value==null||value.equals("null")||value.equals("")) return value;
        String str = value+"";
        //去掉前后空格长度小于等于1的直接返回
        if (str.trim().length()<2) return value;
        String salt = key + "";
        String saltok = salt.replace(" ", "");
        //盐值hash
        int hashSalt = 0;
        str = str.replace(" ", "");
        if (salt.length()<1){
            //没有盐值
        }else {
            hashSalt=Math.abs(saltok.hashCode());
        }
        //正则数字
        java.util.regex.Pattern pattern1 = java.util.regex.Pattern.compile("[0-9]");

        //村区
        String[] randomName= {"修","宵","晨","施","顺","祥","才","聪","银","戈","喻","声","生","铁","如","胜","挚","靖","齐",
                "锦","少","舟","任","载","翱","青","迁","钧","钟","金","慈","昌","紫","砂","仁","祖","韶","绍","锐","峻","裕","镇","壮","商",
                "翼","织","释","诚","常","净","秀","节","刊","信","崇","春","铭","秋","刚","诗","神","星","石","识","肃","瑞","新","鑫",
                "盛","帅","馨","惜","散","慎","世","书","千","善","镜","然","资","笑","疏","西","捷","超","川","锋","实","聚","尊","承","钦",
                "仕","众","思","茂","贤","棕","树","蓝","卷","谷","君","古","原","廉","建","庆","桦","统","若","攀","栋","荒","何","久","侠",
                "奇","朴","鸽","东","嘉","冠","松","啸","祺","琪","雁","宜","琦","枝","坚","昂","毅","歌","标","固","吉","高","康","尧","果",
                "杭","语","曲","肖","荷","芹","乾","义","杰","皓","凯","本","勤","彬","景","月","兼","柏","荣","观","笃","恭",
                "柯","言","菲","萧","乔","群","谦","国","极","轻","玉","业","材","相","苑","倚","岳","柳","贵","悟","健","彦","棋","楷","桐",
                "气","颜","苛","池","闻","流","霜","福","泉","宏","弘","浅","熙","济","涛","震","和","霖","向","波","渊","博","游","雨",
                "润","湛","凡","奔","夫","潮","深","岸","辉","浚","复","封","飞","朋","江","奉","晖","绘","浪","鸣","百","鹤","沙","漾",
                "雪","孝","万","望","瀚","缈","淡","保","阔","洪","恒","云","伯","玄","风","淘","合","文","莫","享","满","溪","妙","邦",
                "华","冰","方","寒","鹏","陌","奋","秉","泽","豪","布","明","民","虎","帆","洋","名","海","潭","清","勉","源","平",
                "沧","霄","熊","论","彤","烟","阳","耀","励","晋","临","伦","日","传","炎","彰","全","丰","晓","瞻","拓","展","绩","炫","尘",
                "征","昙","道","飘","鼎","龙","昊","腾","至","宝","驰","易","耿","昆","振","知","光","灿","智","畅","晴","迪","绿","扬","来",
                "志","煊","遥","宁","衷","太","凌","天","璋","瑾","俊","里","韬","量","致","烨","忠","厉","理","路","年","昭","达","都",
                "蝶","章","照","积","良","泰","烈","庭","进","晟","德","际","琢","利","哲","质","隆","田","煜","南","乐","翎","冬","图",
                "暖","壤","佑","翔","伟","磊","欧","运","豫","维","坤","恩","永","意","野","幽","远","圣","山","城","音","韵","依","余","圆",
                "勋","忆","叶","亦","卫","傲","融","勇","逸","育","唯","基","容","温","安","奥","引","影","羽","均","誉","越","辰","轩","延",
                "境","宇","悠","益","岩","玮","威","硕","庸","懿","统","柏","彤","兼","昊","肖","杰","含","凯","振","秉","沧","享","朋","轻",
                "俊","材","宇","松","依","池","钦","桦","芹","孝","炫","极","洋","舟","际","荒","衷","亦","狂","闻","幽","曲","耿","勇","奇",
                "城","冰","柯","浦","林","和","明","名","建","尧","胜","朴","存","顺","昌","西","昙","砂","语","泰","伦","烈","杭","育","折",
                "达","顷","忠","延","坤","佑","修","闲","坚","泉","劲","勋","枝","年","迁","致","治","健","羽","晓","卷","如","宸","荷","物",
                "合","复","晖","易","灿","浅","悟","壮","临","荣","桦","乔","承","明","顺","物","原","统","哲","庭","运","修","远","峰","兼",
                "杉","莫","均","幽","高","闲","宝","拓","若","材","玮","余","苛","欢","凌","函","享","陌","亦","旷","全","君","思","秀","威",
                "海","烨","尧","声","展","秋","标","羽","昭","合","建","坤","南","利","华","伦","挚","宵","壮","众","晋","松","恩","阳","泉",
                "恭","树","钟","致","苑","封","诗","晓","戏","荣","里","拂","至","奋","初","图","烈","金","如","钦","俊","贵","宸","狂","益",
                "耿","积","复","勋","佑","肃","光","轻","施","任","巧","功","玄","白","田","由","甲","申","用","目","旦","玉","丘","生","主","加","占",
                "可","石","弘","台","叮",
                "包","卉","古","尼","召","巨","司","句","幼","禾","札","本","丙","戊","布","卯","未","末","必","平","市","冬","永","立",
                "央","出","北","甘","刊","扎","母","瓜","正","外","瓦","充","丕",
                "六","光","先","圭","戌","艮","羊","地","至","向","各","吉","名","后","舌","合","回","同","咤","臣","考","多","仲","伉","来",
                "企","伊","全","伍","仰","任","伙","休","价","伏","份","在","行","汀","州","丞","年","存","舟","兆","寺","竹","卉","圳","朱","朴","米",
                "朽","打","汁","次","冰","交","件","列","匠","宅","尖","老","宇","守","安","字","如","亦","聿","因","夷","有","衣","羽","而","危",
                "耳","印","西","先","旭","早","百","自","旨","曲","收","乒","乓","色","此","虫","肉","妃","好","帆","亥","充","再","共","住","佃","但",
                "你","伴","佛","布","伶","夹","利","佣","余","位","伸","宋","彷","畲","七","妞","努","妆","妘","妤","汝","妍",
                "妙","妨","妣","克","谷","告","估","君","吕","兑","束","豆","占","言","佑","佐","吴","吾","呈","杏","串","吹","吟","冶",
                "亨","伯","伺","何","含","别","灶","杜","町","牡","赤","成","弄","坊","更","男","良","里","均",
                "壮","辰","坎","床","杆","杖","李","孚","孝","材","村","杉","杞","秀","池","汐","汕","汗","廷","江","忍","志","删","形",
                "免","车","身","甫","贝","旱","步","判","私","角","改","攻","即","弟","系","忙","兵","冷","宏","完","我","希","序","酉","辛","助",
                "彤","八","佶","供","佰","仑","佬","佛","岱","佩","夜","欣","例","来","侏","佳","征","依","彼","侑","并","往","府","侍","使","姑",
                "姗","姒","始","妹","姓","妮","委","姐","姊","姆","妳","舍","和","咖","刮","咕","固","岩","冾",
                "奇","知","居","林","周","店","味","京","尚","享","昔","卓","明","朋","昏","昊","服","昆","的","帛","昌","坦","昂","旺","者","易","升",
                "昕","松","析","杵","虎","枋","杷","枇","板","林","采","果","兔","枕","柑","杭","枚","东","析","采","青","炒","炊","快","忱","忽",
                "忠","念","忭","忿","杰","炎","定","宙","空","宕","穹","官","宗","宜","宛","雨","沈","沙","沁","冲","沌","汲","沐","承","汽","乳","沛",
                "函","汾","汴","沅","沃","汶","沂","季","孟","坪","物","卦","坤","幸","社","到","坡","坻","硅","坨","岳","岸","玖","抖","扶",
                "乖","沉","孤","盂","氛","版","牧","盲","门","非","庚","冈","奉","争","决","弦",
                "艾","武","协","所","抄","投","抓","抒","折","事","些","卷","劻","届","底","忝","状","竺","亚","券","刷","卸","取",
                "并","奔","劾","其","儿","狄","典","直","延","于","卧","具","金","长","奈","刻","制","祀","祁","秉","弧","房","放",
                "斧","爬","九","勇","面","冠","军","厚","罕","俊","很","俐","侵","促","俗","系","待","信","衍","便","俘","俄","俏","律","后","侯","保",
                "亭","俬","徊","韦","侣","室","客","穿","姨","姻","娃","姜","姝","姚","计","哄","哈","订","却","咨","哉","咱","咻","品",
                "亮","宦","科","秒","柄","柳","柏","枷","拐","柔","香","柿","染","柱","架","查","柯","柚","枯","柑","柒","皇","冒","昴","昧","昱",
                "音","映","宣","星","春","肖","削","前","皆","思","怙","急","怡","怕","炫","南","炯","炬","炭","炳",
                "政","耐","泌","况","沸","癸","泡","沫","沽","泯","泳","油","沿","泉","泣","泄","泗","河","波","法","泓","泛","治","泊","注","泥","沾",
                "沼","垮","型","垂","奎","封","重","致","垣","拆","拐","狗","剎","页","克","垮","拌","拂","抹","叛","披","拔","抛","拓","招","拇","拍",
                "抱","拉","拄","拒","抽","抵","拘","押","拖","抬","芊","芃","芍","芒","玟","玫","珏","玩","毒","屋","幽","禺","竽","耶","食","昶","姿",
                "咸","省","则","相","秋","契","奏","巷","甚","孩","衫","酋","故","牯","皈","杯","看","竿","轨","泰","度","拓",
                "劲","红","表","美","屏","虹","勉","勃","为","弈","狐","盆","革","扁","奕","叛","拜","建","帅","负","赴","砒","帝","界","段","研","纪",
                "既","肚","狙","剌","彦","盈","禹","约","威","羿","施","俞","眉","首","盼","贞","风","奂","飞","竑","爰","十","厝","原",
                "准","凌","凄","座","俱","值","倪","伦","倘","倞","俩","修","倡","倩","倦","徐","径","借","倒","俶","倔","们","俾","徒","俺","倭","倚",
                "个","幸","候","倍","俸","俯","刚","祟","留","峪","峮","城","岛","埔","埋","高","哥","记","唇","炮","唔","唐","讯",
                "哲","讨","托","站","讪","讫","训","员","讦","仓","哦","唈","哺","讧","宫","窈","家","案","窄","容","宬","宸","宴","宰","宵","害",
                "贡","娱","娜","姬","娘","娓","娥","娩","娣","娌","娉","娟","拾","拭","持","按","拱","拷","拮","括","挖","拿","挑","指","拯","按","耘",
                "桂","秧","栩","耕","桉","秘","租","粉","根","框","桌","栘","桑","格","桃","株","秤","秩","梳","冻","校","柴","栽","栓","料","殊","耗",
                "桔","栗","桐","秦","核","洋","洹","洸","恭","洗","洛","洪","洲","流","津","酒","洞","庭","孙","洽","汹","洵","洳","泄","娑","派",
                "洧","恒","耿","烙","恒","恐","烤","恬","烈","晋","晃","烔","肱","恃","息","耻","烘","恰","恕","恢","恩","恤","羔","书","肩","肴","朕",
                "肥","时","肯","殉","骨","股","屑","朔","肢","剔","晁","育","晏","殷","桓","晌","峻","埂","城","峭","峨","峰","峡","崁","芹","芬","芮",
                "芙","芭","芝","芛","芳","芽","芯","芸","花","芥","芫","芷","纹","纱","级","纯","索","紊","纺","纽","纷","纳","纸","秘","神","祠","祖",
                "佑","祝","珈","珀","珊","珍","玻","玳","玲","珅","差","弱","拳","臭","刍","虔","航","配","般","亳","马",
                "圃","亩","迅","躬","库","展","砥","兼","钉","针","耽","只","斗","翁","袁",
                "釜","狩","奚","真","蚓","夏","益","轩","旅","财","素","扇","乘","气","畜","笑","缺","翅","效","起","巡","席","卿","师",
                "奘","疾","矩","砧","衷","闪","旁","停","假","侦","偃","偌","伟","御","悠","偲","术","偶","健","偕","得","爽","偎","伪",
                "修","徘","徙","徜","做","从","侧","偏","康","庸","庾","庶","痕","匿","屠","麻","执","斩","副",
                "软","务","野","邪","阡","邠","邦","那","浩","教","浪","涒","浙","涓","浚","浸","海","涕","泾","浣","涅","浦","消","浦","雪","浴","浮",
                "昆","密","崩","毕","岗","堆","培","埤","基","堂","笛","仑","羚","坚","略","崖","崇","埴","崎","崧","崔","梓","梁",
                "粒","救","梯","桶","条","梨","梵","梆","斜","梧","梢","梭","彪","犁","彬","梅","粗","彩","挺",
                "振","捉","挽","挨","挟","挫","捐","捕","捍","晢","够","胖","干","恿","勖","章","顶","专","将","竟","您","胄","鸟","胎",
                "悌","昼","皎","烹","眺","袒","豚","曼","尉","望","鱼","悁","胤","焉","晚","晤","悟","焊","胃","习","晟","患","晨","胥","冕","晦","曹",
                "悉","敏","悍","奢","国","甜","念","朱","袈","诀","区","欲","问","唯",
                "启","毫","设","常","商","船","许","唱","讼","孰","访","啡","婕","娄","婀","婉",
                "婆","珠","珞","佩","珙","珪","琉","敖","珣","晌","班","寄","寇","窒","窕","寀","寂","宿","寅","扎","累","终","统","绊","绍","组",
                "细","绅","茁","笠","英","苑","茄","若","范","茉","茂","笨","苓","苕","苙","苞","茅","苗","苦","苹","苾","苟","荏","苔","笙","符","祥",
                "强","旋","雀","处","顷","产","族","袖","牵","率","瓷","蛇","疏","参","巢","狭","匙","戚","羞","舷","蛆","蚯","赦","酗","袪","麦","凰",
                "闭","觅","货","被","票","败","悔","背","瓶","瓠","舶","袍","馗","勘","钵","釱","钓","钏","钗","翎","张","蛋","袋","鹿","第","贪","伧",
                "傒","徨","备","博","街","傅","傍","贷","家","循","婿","婼","媒","婷","媚","媞","媛","堪","凯","岚","崴","尧","场","堡","嵋","啼",
                "喃","喻","喝","喉","证","距","注","喜","善","喨","舒","创","诉","词","单","唤","彭","跑","喧","评","诃","结",
                "喇","就","邵","卷","采","捧","排","舍","挂","捷",
                "棕","棵","植","杰","棠","栋","集","栈","椅","程","稀","窗","栖"};
        //省
        String[] provinces = {"吉林","广东","山东","河南","河北","四川"};
//------------------------------------------------------------------------------------------
        //直辖市
//        String[] arrZhiXiaShi = {"北京","上海","天津"};
        //省下面的市
        String[] jilin ={"吉林市","长春市","白山市","延边州","白城市","松原市","辽源市","通化市","四平市"};
        String[] guangdong ={"东莞市","广州市","深圳市","惠州市","江门市","珠海市","汕头市","佛山市","湛江市","河源市","肇庆市","清远市","潮州市","韶关市","揭阳市","阳江市","梅州市","云浮市","茂名市","汕尾市"};
        String[] shandong ={"济南市","青岛市","临沂市","济宁市","菏泽市","烟台市","淄博市","泰安市","潍坊市","日照市","威海市","滨州市","东营市","聊城市","德州市","莱芜市","枣庄市"};
        String[] henan ={"郑州市","南阳市","新乡市","安阳市","洛阳市","信阳市","平顶山市","周口市","商丘市","开封市","焦作市","驻马店市","濮阳市","三门峡市","漯河市","许昌市","鹤壁市"};
        String[] hebei ={"石家庄市","唐山市","保定市","邯郸市","邢台市","沧州市","秦皇岛市","张家口市","衡水市","廊坊市","承德市"};
        String[] sichuan ={"成都市","绵阳市","广元市","达州市","南充市","德阳市","广安市","阿坝州","巴中市","遂宁市","内江市","凉山州","攀枝花市","乐山市","自贡市","泸州市","雅安市","宜宾市","资阳市","眉山市","甘孜州"};

        //没用上
        String[][] shi = {jilin,guangdong,shandong,henan,hebei,sichuan};

        //市下面的区和县
        //吉林
        String[] beijing ={"朝阳区","海淀区","通州区","房山区","丰台区","昌平区","大兴区","顺义区","西城区","延庆县","石景山区","宣武区","怀柔区","崇文区","密云县","东城区","平谷区","门头沟区"};
        String[] changchun ={"南关区","宽城区","朝阳区","二道区","绿园区","双阳区","九台区","榆树市","德惠市","农安县"};
        String[] jilins ={"船营区","龙潭区","昌邑区","丰满区","永吉县","磐石市","桦甸市","蛟河市","舒兰市"};
        String[] baishan ={"长白朝鲜族自治县","抚松县","靖宇县","临江市","浑江区"};
        String[] yanbian ={"延吉市","图们市","龙井市","和龙市","汪清县","安图县"};
        String[] baicheng ={"大安市","洮北区","洮南区","通榆县","镇赉县"};
        String[] songyuan ={"扶余县","宁江区","前郭尔罗斯蒙古族自治县","乾安县","长岭县"};
        String[] liaoyuan ={"龙山区","西安区","东丰县","东辽县"};
        String[] tonghua ={"东昌区","二道江区","通化县","柳河县","辉南县"};
        String[] siping ={"铁西区","铁东区","双辽市","梨树县","伊通满族自治县","公主岭市"};
        //广东
        String[] dongguan ={"莞城区","东城区","南城区","万江区"};
        String[] guangzhou ={"越秀区","荔湾区","海珠区","天河区","白云区","黄埔区","萝岗区","番禺区","花都区","南沙区","萝岗区","增城市","从化市"};
        String[] shenzhen ={"宝安区","福田区","龙岗区","罗湖区","南山区","盐田区"};
        String[] huizhou ={"惠城区","惠阳区","惠东县","博罗县","龙门县"};
        String[] jiangmen ={"蓬江区","江海区","新会区","台山市","开平市","鹤山市","恩平市"};
        String[] zhuahi ={"斗门区","金湾区","香洲区"};
        String[] shantou ={"金平区","龙湖区","澄海区","濠江区","潮南区","潮阳区","南澳县"};
        String[] foshan ={"禅城区","南海区","顺德区","高明区","三水区"};
        String[] zhanjiang ={"赤坎区","雷州市","廉江市","麻章区","坡头区","遂溪县","吴川市","霞山区","徐闻县"};
        String[] heyuan ={"源城区","和平县","龙川县","东源县","紫金县","连平县"};
        String[] zhaoqing ={"端州区","鼎湖区","高要区","广宁县","怀集县","封开县","德庆县","四会区"};
        String[] qingyuan ={"清城区","清新区","佛冈县","阳山县","连南瑶族自治县","连山壮族瑶族自治县","英德市","连州市"};
        String[] chaozhou ={"湘桥区","潮安区","枫溪区","饶平县"};
        String[] meizhou ={"兴宁市","梅江区","梅县区","大埔县","丰顺县","五华县","平远县","蕉岭县"};
        String[] shaoguan ={"浈江区","武江区","曲江区","乐昌市","南雄市","始兴县","仁化县","翁源县","新丰县","乳源瑶族自治县"};
        String[] jieyang ={"榕城区","揭东区","揭西县","惠来县","普宁市"};
        String[] yangjiang ={"江城区","阳东区","阳西县","阳春市"};
        String[] yunfu ={"云城区","罗定市","云安区","新兴县","郁南县"};
        String[] maoming ={"茂南区","电白区","高州市","化州市","信宜市"};
        String[] shanwei ={"城区","陆丰市","海丰县","陆河县"};
        //山东
        String[] jinan ={"历下区","市中区","槐荫区","天桥区","历城区","长清区","平阴县","济阳县","商河县","章丘市"};
        String[] qingdao ={"市南区","市北区","黄岛区","崂山区","李沧区","胶州市","即墨市","平度市","莱西市"};
        String[] liyi ={"兰山区","罗庄区","河东区","郯城县","兰陵县","莒南县","沂水县","蒙阴县","平邑县","费县","沂南县","临沭县"};
        String[] jining ={"任城区","兖州区","微山县","鱼台县","金乡县","嘉祥县","汶上县","泗水县","梁山县"};
        String[] heze ={"牡丹区","开发区","定陶区","巨野县","曹县","成武县","单县","郓城县","鄄城县","东明县"};
        String[] yantai ={"烟台高新技术产业开发区","烟台经济技术开发区","芝罘区","福山区","牟平区","莱山区","长岛县","龙口市","莱阳市","莱州市","蓬莱市","招远市","栖霞市","海阳市"};
        String[] zibo ={"张店区","淄川区","博山区","周村区","临淄区","桓台县","高青县","沂源县"};
        String[] taian ={"泰山区","岱岳区","新泰市","肥城市","宁阳县","东平县"};
        String[] weifang ={"潍城区","奎文区","坊子区","寒亭区","青州市","诸城市","寿光市","安丘市","高密市","昌邑市","昌乐县","临朐县"};
        String[] rizhao ={"东港区","岚山区","莒县","五莲县","日照经济技术开发区","山海天旅游度假区","日照高新技术产业开发区","日照国际海洋城"};
        String[] weihai ={"地级威海市包括环翠区","文登区","经济技术开发区","火炬高技术产业开发区","进出口加工保税区","临港经济技术开发区","南海新区","荣成市","乳山市"};
        String[] bingzhou ={"滨城区","沾化区","邹平县","博兴县","惠民县","阳信县","无棣县"};
        String[] dongying ={"东营区","河口区","广饶县","垦利县","利津县"};
        String[] liaocheng ={"东昌府区","开发区","临清市","茌平","东阿","高唐","阳谷","冠县","莘县","莱州市","蓬莱市","招远市","栖霞市","海阳市"};
        String[] dezhou ={"德州市辖德城区","陵城区","禹城市","乐陵市","临邑县","平原县","夏津县","武城县","庆云县","宁津县","齐河县"};
        String[] laiwu ={"莱城区","钢城区"};
        String[] zaozhuang ={"薛城区","市中区","峄城区","山亭区","台儿庄区","滕州市"};
        //河南
        String[] zhengzhou ={"中原区","二七区","管城回族区","金水区","上街区","惠济区","中牟县","巩义市","荥阳市","新密市","新郑市","登封市"};
        String[] nanyang ={"宛城区","卧龙区","南召县","镇平县","内乡县","淅川县","新野县","唐河县","桐柏县","方城县","西峡县","社旗县"};
        String[] xinxiang ={"平原示范区","卫滨区","红旗区","凤泉区","牧野区","卫辉市","辉县市","新乡县","获嘉县","原阳县","延津县","封丘县"};
        String[] anyang ={"文峰区","北关区","殷都区","龙安区","安阳县","汤阴县","内黄县","林州市"};
        String[] luoyang ={"涧西区","西工区","老城区","瀍河回族区","洛龙区","吉利区","偃师市","孟津县","新安县","宜阳县","伊川县","洛宁县","嵩县","栾川县","汝阳县"};
        String[] xinyang ={"浉河区","平桥区","息县","新县","罗山县","潢川县","光山县","商城县","固始县","淮滨县"};
        String[] pingdingshan ={"辖新华区","卫东区","湛河区","石龙区","舞钢市","叶县","鲁山","宝丰","郏县"};
        String[] zhoukou ={"川汇区","扶沟县","西华县","商水县","沈丘县","郸城县","淮阳县","太康县","鹿邑县","项城市"};
        String[] shangqiu ={"永城市","睢阳区","梁园区","商丘新区","虞城县","柘城县","夏邑县","民权县","睢县","宁陵县"};
        String[] kaifeng ={"鼓楼区","龙亭区","禹王台区","顺河回族区","祥符区和尉氏县","兰考县","杞县","通许县"};
        String[] jiaozuo ={"解放区","中站区","马村区","山阳区","修武县","博爱县","武陟县","温县","沁阳市","孟州市"};
        String[] zhumadian ={"驿城区","确山县","泌阳县","遂平县","西平县","上蔡县","汝南县","平舆县","正阳县","经济开发区","工业集聚区","装备产业集聚区"};
        String[] puyang ={"华龙区","开发区","濮阳县","清丰县","南乐县","范县","台前县"};
        String[] sanxiamen ={"湖滨区","渑池县","陕州区","卢氏县","义马市","灵宝市"};
        String[] luohe ={"临颍县","舞阳县","郾城区","源汇区","召陵区"};
        String[] xuchang ={"魏都区","许昌县","鄢陵县","襄城县","禹州市","长葛市"};
        String[] hebi ={"淇滨区","山城区","鹤山区","淇县","浚县"};
        //河北
        String[] shijiazhuang ={"新华区","桥西区","长安区","裕华区","矿区","藁城区","鹿泉区","栾城区","辛集市","晋州市","新乐市","正定县","深泽县","无极县","赵县","高邑县","元氏县","赞皇县","井陉县","平山县","灵寿县","行唐县"};
        String[] tangshan ={"路南区","路北区","古冶区","开平区","丰南区","丰润区","曹妃甸区","滦县","滦南县","乐亭县","迁西县","玉田县","遵化市","迁安市"};
        String[] baoding ={"定州市","竞秀区","莲池区","满城区","清苑区","徐水区","高碑店市","安国市","涞水县","唐县","易县","涞源县","定兴县","顺平县","望都县","高阳县","安新县","雄县","容城县","曲阳县","阜平县","博野县","蠡县"};
        String[] handan ={"邯山区","丛台区","复兴区","峰峰矿区","邯郸县","临漳县","成安县","大名县","涉县","磁县","肥乡县","永年县","邱县","鸡泽县","广平县","馆陶县","魏县","曲周县","武安市"};
        String[] xingtai ={"桥东区","桥西区","南宫市","沙河市","邢台县","柏乡县","柏乡县","宁晋县","隆尧县","临城县","广宗县","临西县","内丘县","平乡县","巨鹿县","新河县","南和县"};
        String[] cangzhou ={"运河区","新华区","泊头市","任丘市","黄骅市","河间市","沧县","青县","东光县","海兴县","盐山县","肃宁县","南皮县","吴桥县","献县","孟村回族自治县"};
        String[] qinhuangdao ={"海港区","山海关区","抚宁区","北戴河区","青龙县","昌黎县","卢龙县"};
        String[] zhangjiakou ={"桥西区","桥东区","下花园区","宣化区","万全区","崇礼区","张北县","康保县","沽源县","尚义县","蔚县","阳原县","怀安县","怀来县","涿鹿县","赤城县"};
        String[] hengshui ={"桃城区","滨湖新区","工业新区","冀州","深州","枣强县","武邑县","武强县","饶阳县","安平县","故城县","阜城县","景县"};
        String[] langfang ={"三河市","霸州市","香河县","固安县","永清县","文安县","大城县","大厂回族自治县"};
        String[] chengde ={"承德县","隆化县","围场县","丰宁县","滦平县","兴隆县","青龙县","平泉县"};
        //四川
        String[] chengdu ={"武侯区","锦江区","青羊区","金牛区","成华区","龙泉驿区","温江区","新都区","青白江区","双流区","郫县","蒲江县","大邑县","金堂县","新津县","都江堰市","彭州市","邛崃市","崇州市","简阳市"};
        String[] mianyang ={"涪城区","游仙区","安州区","三台县","盐亭县","梓潼县","平武县","北川羌族自治县","江油市"};
        String[] guangyuan ={"利州区","昭化区","朝天区","旺苍县","青川县","剑阁县","苍溪县"};
        String[] dazhou ={"通川区","达川区","宣汉县","开江县","大竹县","渠县","万源市"};
        String[] nanyun ={"顺庆区","高坪区","嘉陵区","西充县","南部县","蓬安县","营山县","仪陇县","阆中市"};
        String[] deyang ={"旌阳区","什邡市","广汉市","绵竹市","罗江县","中江县"};
        String[] guangan ={"广安区","前锋区","岳池县","武胜县","邻水县","华蓥市"};
        String[] aba ={"马尔康市","九寨沟县","小金县","阿坝县","若尔盖县","红原县","壤塘县","汶川县","理县","茂县","松潘县","金川县","黑水县"};
        String[] bazhong ={"巴州区","恩阳区","通江县","南江县","平昌县"};
        String[] suining ={"船山区","安居区","射洪县","蓬溪县","大英县"};
        String[] neijiang ={"市中区","东兴区","资中县","威远县","隆昌县"};
        String[] liangshan ={"西昌市","盐源县","德昌县","会理县","会东县","宁南县","普格县","布拖县","金阳县","昭觉县","喜德县","冕宁县","越西县","甘洛县","美姑县","雷波县","木里藏族自治县"};
        String[] panzhihua ={"东区","西区","仁和区","米易县","盐边县"};
        String[] zigong ={"自流井区","贡井区","大安区","沿滩区","荣县","富顺县"};
        String[] luzhou ={"江阳区","龙马潭区","纳溪区","纳溪区","泸县","合江县","叙永县","古蔺县"};
        String[] yaan ={"雨城区","名山区","县荥经县","汉源县","石棉县","天全县","芦山县","宝兴县"};;
        String[] yibin ={"翠屏区","南溪区","宜宾县","江安县","长宁县","高县","筠连县","珙县","兴文县","屏山县"};
        String[] ziyang ={"雁江区","安岳县","乐至县"};
        String[] meishan ={"东坡区","彭山区","仁寿县","丹棱县","青神县","洪雅县"};
        String[] ganzi ={"康定市","泸定县","丹巴县","九龙县","雅江县","道孚县","炉霍县","甘孜县","新龙县","德格县","白玉县","石渠县","色达县","理塘县","巴塘县","乡城县","稻城县","得荣县"};



        java.util.HashMap shengTOshi = new java.util.HashMap();
        shengTOshi.put("吉林",jilin);
        shengTOshi.put("广东",guangdong);
        shengTOshi.put("山东",shandong);
        shengTOshi.put("河南",henan);
        shengTOshi.put("河北",hebei);
        shengTOshi.put("四川",sichuan);







//        HashMap<String,String[]> zhiXiaShi = new HashMap<>();
//        zhiXiaShi.put("北京",beijing);

        java.util.HashMap shiTOqu = new java.util.HashMap();
        shiTOqu.put("北京",beijing);
        //吉林
        shiTOqu.put("吉林市",jilins);
        shiTOqu.put("长春市",changchun);
        shiTOqu.put("白山市",baishan);
        shiTOqu.put("延边州",yanbian);
        shiTOqu.put("白城市",baicheng);
        shiTOqu.put("松原市",songyuan);
        shiTOqu.put("辽源市",liaoyuan);
        shiTOqu.put("通化市",tonghua);
        shiTOqu.put("四平市",siping);
        //广东
        shiTOqu.put("东莞市",dongguan);
        shiTOqu.put("广州市",guangzhou);
        shiTOqu.put("深圳市",shenzhen);
        shiTOqu.put("惠州市",huizhou);
        shiTOqu.put("江门市",jiangmen);
        shiTOqu.put("珠海市",zhuahi);
        shiTOqu.put("汕头市",shantou);
        shiTOqu.put("佛山市",foshan);
        shiTOqu.put("湛江市",zhanjiang);
        shiTOqu.put("河源市",heyuan);
        shiTOqu.put("肇庆市",zhaoqing);
        shiTOqu.put("清远市",qingyuan);
        shiTOqu.put("潮州市",chaozhou);
        shiTOqu.put("梅州市",meizhou);
        shiTOqu.put("韶关市",shaoguan);
        shiTOqu.put("揭阳市",jieyang);
        shiTOqu.put("阳江市",yangjiang);
        shiTOqu.put("云浮市",yunfu);
        shiTOqu.put("茂名市",maoming);
        shiTOqu.put("汕尾市",shanwei);
        //山东
        shiTOqu.put("济南市",jinan);
        shiTOqu.put("青岛市",qingdao);
        shiTOqu.put("临沂市",liyi);
        shiTOqu.put("济宁市",jining);
        shiTOqu.put("菏泽市",heze);
        shiTOqu.put("烟台市",yantai);
        shiTOqu.put("淄博市",zibo);
        shiTOqu.put("泰安市",taian);
        shiTOqu.put("潍坊市",weifang);
        shiTOqu.put("日照市",rizhao);
        shiTOqu.put("威海市",weihai);
        shiTOqu.put("滨州市",bingzhou);
        shiTOqu.put("东营市",dongying);
        shiTOqu.put("聊城市",liaocheng);
        shiTOqu.put("德州市",dezhou);
        shiTOqu.put("莱芜市",laiwu);
        shiTOqu.put("枣庄市",zaozhuang);
        //河南
        shiTOqu.put("郑州市",zhengzhou);
        shiTOqu.put("南阳市",nanyang);
        shiTOqu.put("新乡市",xinxiang);
        shiTOqu.put("安阳市",anyang);
        shiTOqu.put("洛阳市",luoyang);
        shiTOqu.put("信阳市",xinyang);
        shiTOqu.put("平顶山市",pingdingshan);
        shiTOqu.put("周口市",zhoukou);
        shiTOqu.put("商丘市",shangqiu);
        shiTOqu.put("开封市",kaifeng);
        shiTOqu.put("焦作市",jiaozuo);
        shiTOqu.put("驻马店市",zhumadian);
        shiTOqu.put("濮阳市",puyang);
        shiTOqu.put("三门峡市",sanxiamen);
        shiTOqu.put("漯河市",luohe);
        shiTOqu.put("许昌市",xuchang);
        shiTOqu.put("鹤壁市",hebi);
        //河北
        shiTOqu.put("石家庄市",shijiazhuang );
        shiTOqu.put("唐山市",tangshan);
        shiTOqu.put("保定市",baoding);
        shiTOqu.put("邯郸市",handan);
        shiTOqu.put("邢台市",xingtai);
        shiTOqu.put("沧州市",cangzhou);
        shiTOqu.put("秦皇岛市",qinhuangdao);
        shiTOqu.put("张家口市",zhangjiakou);
        shiTOqu.put("衡水市",hengshui);
        shiTOqu.put("廊坊市",langfang);
        shiTOqu.put("承德市",chengde);
        //四川
        shiTOqu.put("成都市",chengdu);
        shiTOqu.put("绵阳市",mianyang);
        shiTOqu.put("广元市",guangyuan);
        shiTOqu.put("达州市",dazhou);
        shiTOqu.put("南充市",nanyun);
        shiTOqu.put("德阳市",deyang);
        shiTOqu.put("广安市",guangan);
        shiTOqu.put("阿坝州",aba);
        shiTOqu.put("巴中市",bazhong);
        shiTOqu.put("遂宁市",suining);
        shiTOqu.put("内江市",neijiang);
        shiTOqu.put("凉山州",liangshan);
        shiTOqu.put("攀枝花市",panzhihua);
        shiTOqu.put("自贡市",zigong);
        shiTOqu.put("泸州市",luzhou);
        shiTOqu.put("雅安市",yaan);
        shiTOqu.put("宜宾市",yibin);
        shiTOqu.put("资阳市",ziyang);
        shiTOqu.put("眉山市",meishan);
        shiTOqu.put("甘孜州",ganzi);

        String newStrSheng="";
        String newStrShi="";
        String newStrXian="";
        String newStrQu="";
        String newCun = "";
        //默认hash是盐
        int hash1 = hashSalt;
        //type= :1 只有省没有市 2 有省有市 3 没省有市
        int type = 0;
        //获取省
        if (str.contains("省")) {
            String[] arrStr1 = str.split("省");
            if (arrStr1.length < 2) return value;
            hash1 = Math.abs(arrStr1[0].hashCode() + hashSalt);
            newStrSheng = provinces[hash1 % (provinces.length - 1)];
            str = arrStr1[1];
            type = 1;
        }
        //获取市
        if (str.contains("市")) {
            String[] arrStr1 = str.split("市");
            if (arrStr1.length < 2) return value;
            hash1 = Math.abs(arrStr1[0].hashCode() + hashSalt);
            if (type == 1) {
                newStrShi = ((String[])shengTOshi.get(newStrSheng))[hash1 % (((String[])shengTOshi.get(newStrSheng)).length - 1)];
                type = 2;
            }else {
                String[] arryTemp = shi[hash1 % (shi.length - 1)];
                newStrShi =arryTemp[hash1 % (arryTemp.length - 1)];
                type=3;
            }
            str = "";
            for (int i = 1; i <arrStr1.length ; i++) {
                str+=arrStr1[i]+"市";
            }
            str = str.substring(0,str.length()-1);
        }
        //-------------------------------------------------------------
        if (str.contains("县")) {
            String[] arrStr1 = str.split("县");
            if (arrStr1.length < 2) return value;
            hash1 = Math.abs(arrStr1[0].hashCode() + hashSalt);
            if (type==1){
                newStrShi = ((String[])shengTOshi.get(newStrSheng))[hash1 % (((String[])shengTOshi.get(newStrSheng)).length - 1)];
                newStrQu = ((String[])shiTOqu.get(newStrShi))[hash1 % (((String[])shiTOqu.get(newStrShi)).length - 1)];
                newStrShi="";
            }
            if (type==2){
                newStrQu = ((String[])shiTOqu.get(newStrShi))[hash1 % (((String[])shiTOqu.get(newStrShi)).length - 1)];
            }
            if (type==3){
                newStrQu = ((String[])shiTOqu.get(newStrShi))[hash1 % (((String[])shiTOqu.get(newStrShi)).length - 1)];
            }
            str = arrStr1[1];
        }else if (str.contains("区")) {
            if (str.contains("小区")){
                String[] arrStr1xiaoqu = str.split("小区");
                String tem = "";
                if (arrStr1xiaoqu[0].contains("区")){
                    String[] arrStr1 = str.split("区");
                    tem = arrStr1[1];
                    if (arrStr1.length < 2) return value;
                    hash1 = Math.abs(arrStr1[0].hashCode() + hashSalt);

                    if (type==1){
                        newStrShi = ((String[])shengTOshi.get(newStrSheng))[hash1 % (((String[])shengTOshi.get(newStrSheng)).length - 1)];
                        newStrQu = ((String[])shiTOqu.get(newStrShi))[hash1 % (((String[])shiTOqu.get(newStrShi)).length - 1)];
                        newStrShi="";
                    }
                    if (type==2){
                        newStrQu = ((String[])shiTOqu.get(newStrShi))[hash1 % (((String[])shiTOqu.get(newStrShi)).length - 1)];
                    }
                    if (type==3){
                        newStrQu = ((String[])shiTOqu.get(newStrShi))[hash1 % (((String[])shiTOqu.get(newStrShi)).length - 1)];
                    }

                }
                str=tem+"小区"+arrStr1xiaoqu[1];
            }else {
                String[] arrStr1 = str.split("区");
                if (arrStr1.length < 2) return value;
                hash1 = Math.abs(arrStr1[0].hashCode() + hashSalt);
                if (type==1){
                    newStrShi = ((String[])shengTOshi.get(newStrSheng))[hash1 % (((String[])shengTOshi.get(newStrSheng)).length - 1)];
                    newStrQu = ((String[])shiTOqu.get(newStrShi))[hash1 % (((String[])shiTOqu.get(newStrShi)).length - 1)];
                    newStrShi="";
                }
                if (type==2){
                    newStrQu = ((String[])shiTOqu.get(newStrShi))[hash1 % (((String[])shiTOqu.get(newStrShi)).length - 1)];
                }
                if (type==3){
                    newStrQu = ((String[])shiTOqu.get(newStrShi))[hash1 % (((String[])shiTOqu.get(newStrShi)).length - 1)];
                }
                str ="";
                for (int i = 1; i <arrStr1.length ; i++) {
                    str+=arrStr1[i]+"区";
                }
                str = str.substring(0,str.length()-1);
            }
        }

        String[] arrStr = new String [str.length()];
        for (int i = 0; i <arrStr.length ; i++) {
            arrStr[i] = str.substring(i,i+1);
        }

        for (int i = 0; i <arrStr.length ; i++) {
            try {
                if (arrStr[i].contains("小") && arrStr[i + 1].contains("区")){
                    i+=1;
                    continue;
                }
                if (arrStr[i].contains("单") && arrStr[i + 1].contains("元")){
                    i+=1;
                    continue;
                }
                if (arrStr[i].contains("大") && arrStr[i + 1].contains("街")){
                    i+=1;
                    continue;
                }
                if (arrStr[i].contains("酒") && arrStr[i + 1].contains("店")){
                    i+=1;
                    continue;
                }

                if (arrStr[i].contains("公") && arrStr[i + 1].contains("司")){
                    i+=1;
                    continue;
                }
                if (arrStr[i].contains("花") && arrStr[i + 1].contains("园")){
                    i+=1;
                    continue;
                }


                if (arrStr[i].contains("社") && arrStr[i + 1].contains("区")){
                    i+=1;
                    continue;
                }
                if (arrStr[i].contains("宿") && arrStr[i + 1].contains("舍")){
                    i+=1;
                    continue;
                }
            }catch (ArrayIndexOutOfBoundsException e){
                i+=1;
                continue;
            }
            if (arrStr[i].contains("市")){
                arrStr[i]="街";
                continue;
            }
            if (arrStr[i].contains("路"))continue;
            if (arrStr[i].contains("楼"))continue;
            if (arrStr[i].contains("栋"))continue;
            if (arrStr[i].contains("幢"))continue;
            if (arrStr[i].contains("第"))continue;
            if (arrStr[i].contains("号"))continue;
            if (arrStr[i].contains("镇"))continue;
            if (arrStr[i].contains("乡"))continue;
            if (arrStr[i].contains("村"))continue;
            if (arrStr[i].contains("组"))continue;
            if (arrStr[i].contains("户"))continue;
            if (arrStr[i].contains("室"))continue;
            if (arrStr[i].contains("东"))continue;
            if (arrStr[i].contains("西"))continue;
            if (arrStr[i].contains("南"))continue;
            if (arrStr[i].contains("北"))continue;
            if (pattern1.matcher(arrStr[i]).matches()){
                String s1 = Math.abs(arrStr[i].hashCode()+hashSalt)+"";
                arrStr[i]=s1.substring(s1.length()-1,s1.length());
                continue;
            }
            int hashTemp = Math.abs(arrStr[i].hashCode()+hashSalt);
            arrStr[i] = randomName[hashTemp % (randomName.length - 1)];
        }

        for (int i = 0; i <arrStr.length ; i++) {
            newCun+=arrStr[i];
        }
        if (!newStrSheng.equals("")){
            newStrSheng+="省";
        }
        return newStrSheng+newStrShi+newStrXian+newStrQu+newCun;
    }

    public static Object getR(Object value, Object key){
        return "";
    }





}
