package two_param.company;

/**
 * Created by ${LiuShuo} on 2016/6/22.
 */
public class Company {
    public static Object getM(Object value, Object key){

        //判断参数是否为null、"null"、"" ,为true时不做处理
        if (value==null||value.equals("null")||value.equals("")) return value;
        String str = value+"";
        //去掉前后空格长度小于等于1的直接返回
        if (str.trim().length()<2) return value;
        String salt = key + "";
        String saltok = salt.replace(" ", "");
        //盐值hash
        int hashSalt = 0;

        if (salt.length()<1){
            //没有盐值
        }else {
            hashSalt=Math.abs(saltok.hashCode());
        }

        /*  公司名 */
        String[] Surname= {"修","宵","晨","戏","施","顺","祥","才","聪","银","戈","喻","声","生","铁","如","宸","誓","胜","挚","靖","齐",
                "锦","少","舟","任","载","翱","青","迁","钧","钟","金","慈","昌","紫","砂","仁","祖","韶","绍","锐","峻","裕","镇","壮","商",
                "翼","织","释","诚","常","净","秀","节","刊","信","崇","春","铭","秋","刚","诗","神","星","鉴","石","识","肃","瑞","新","鑫",
                "盛","帅","馨","惜","散","慎","世","书","千","善","镜","然","资","笑","疏","西","捷","超","川","锋","实","聚","尊","承","钦",
                "仕","众","思","茂","贤","棕","树","蓝","卷","谷","君","古","原","廉","建","庆","桦","统","若","攀","栋","荒","何","久","侠",
                "奇","朴","鸽","东","嘉","冠","松","啸","祺","琪","雁","宜","琦","枝","坚","昂","毅","歌","标","固","吉","高","康","尧","果",
                "杭","语","曲","肖","荷","芹","乾","义","杰","皓","凯","狂","本","勤","彬","景","月","兼","顷","柏","擎","荣","观","笃","恭",
                "柯","言","菲","萧","乔","群","谦","国","极","轻","玉","业","材","相","苑","倚","岳","柳","贵","悟","健","彦","棋","楷","桐",
                "气","颜","苛","池","闻","流","霜","福","泉","宏","弘","浅","熙","济","涛","震","和","闲","霖","向","波","渊","博","游","雨",
                "润","湛","凡","奔","夫","潮","深","岸","辉","浚","复","封","飞","朋","江","奉","晖","绘","浪","鸣","百","鹤","沙","漾","泥",
                "雪","孝","万","望","瀚","缈","淡","阜","保","阔","洪","恒","云","伯","玄","风","淘","合","文","莫","享","满","溪","妙","邦",
                "华","冰","方","寒","鹏","陌","奋","秉","泽","豪","布","明","民","虎","帆","洋","名","拂","海","潭","清","勉","源","平","物",
                "沧","霄","熊","论","彤","烟","阳","耀","励","晋","临","伦","日","传","炎","彰","全","丰","晓","瞻","拓","展","绩","炫","尘",
                "征","昙","道","飘","鼎","龙","昊","腾","至","宝","驰","易","耿","昆","振","知","光","灿","智","畅","晴","迪","绿","扬","来",
                "志","煊","遥","宁","衷","太","凌","天","璋","瑾","俊","里","韬","量","致","烨","忠","厉","理","路","年","循","昭","达","都",
                "蝶","章","照","积","良","泰","烈","庭","折","进","晟","德","际","琢","利","哲","质","隆","田","煜","南","乐","翎","冬","图",
                "暖","壤","佑","翔","伟","磊","欧","运","豫","维","坤","恩","永","意","野","幽","远","圣","山","城","音","韵","依","余","圆",
                "勋","忆","叶","亦","卫","傲","融","勇","逸","育","唯","基","容","温","安","奥","引","影","羽","均","誉","越","辰","轩","延",
                "境","宇","悠","益","岩","玮","威","硕","庸","懿","统","柏","彤","兼","昊","肖","杰","含","凯","振","秉","沧","享","朋","轻",
                "俊","材","宇","松","依","池","钦","桦","芹","孝","炫","极","洋","舟","际","荒","衷","亦","狂","闻","幽","曲","耿","勇","奇",
                "城","冰","柯","浦","林","和","明","名","建","尧","胜","朴","存","顺","昌","西","昙","砂","语","泰","伦","烈","杭","育","折",
                "达","顷","忠","延","坤","佑","修","闲","坚","泉","劲","勋","枝","年","迁","致","治","健","羽","晓","卷","如","宸","荷","物",
                "合","复","晖","易","灿","浅","悟","壮","临","荣","桦","乔","承","明","顺","物","原","统","哲","庭","运","修","远","峰","兼",
                "杉","莫","均","幽","高","闲","宝","拓","若","材","玮","余","苛","欢","凌","函","享","陌","亦","旷","全","君","思","秀","威",
                "海","烨","尧","声","展","秋","标","羽","昭","合","建","坤","南","利","华","伦","挚","宵","壮","众","晋","松","恩","阳","泉",
                "恭","树","钟","致","苑","封","诗","晓","戏","荣","里","拂","至","奋","初","图","烈","金","如","钦","俊","贵","宸","狂","益",
                "耿","积","复","勋","佑","肃","光","轻","施","任"};
        //行政区域
        String[] xingZheng = {"北京","天津","河北","山西","辽宁","吉林","黑龙江","上海","江苏","浙江","安徽","福建","江西","山东","河南","湖北","湖南","广东","海南","重庆","四川","贵州","云南","陕西","甘肃","青海","宁夏"};



        String temp = "";
        String newName="";
        int nameHashCode=0;
        //公司截取转换后名
        String newCName1 ="";
        String newCName2 ="";
        //验证是否为公司
        int company = 0;

        if (str.contains("有限")){
            company =1;
        }else if (str.contains("公司")){
            company =2;
        }

        if (company == 0) return value;
        if (company == 1) {

            String regex = "有限";
            String strAry[] = str.split(regex);
            if (strAry.length<2)return value;
            str = strAry[0];
            newCName2 = "有限" + strAry[1];
        }
        if (company == 2) {
            String regex = "公司";
            String strAry[] = str.split(regex);
            if (strAry.length==0)return value;
            str = strAry[0];
            newCName2 = "公司";
        }

        //转换成数组
        String[] nameArray = new String [str.length()];
        for (int i=0;i<str.length();i++){
            nameArray[i] = str.substring(i,i+1);
            temp=nameArray[i];
            nameHashCode = Math.abs(temp.hashCode()+hashSalt);
            newCName1 += Surname[nameHashCode%(Surname.length-1)];
        }
        if (newCName1.length()>3){
            String s = xingZheng[nameHashCode%(xingZheng.length-1)];
            newCName1=s+newCName1.substring(2,newCName1.length());

        }

        return newCName1+newCName2;





    }

    public static Object getR(Object value, Object key){
        return "";
    }
}
